
// Какое то код рандом
//int random = new Random().Next(0, 4); // 0 1 2 3
//System.Console.WriteLine(random);

//Напишите программу, которая на вход принимает два числа и выдает, какое чило больше, а какое меньше.